# Конспект 16 сентября 2021

**Упражнение 1**. Написать программу для вывода первых `n` чисел Фибоначчи.

**Упражнение 2**. Написать программу для проверки простоты натурального числа. Число вводится с клавиатуры.

## Массивы

Массив - это *структура данных* для работы с коллекцией элементов. Массив Си - это группа элементов *одного типа*, расположенных в памяти *последовательно*.

Определить массив целых можно так:

```c
int arr[12];
```

При этом выделяется память для хранения `12` элементов типа `int`. Значения элементов массива не инициализируются (т.е. могут быть любыми). Проинициализировать значения элементов можно с помощью цикла `for`:

```c
for (int i = 0; i < 12; ++i) {
    arr[i] = 0;
}
```

Этот пример показывает, что к элементам массива можно обращаться по индексу с помощью оператора квадратных скобок `[]`. Индекс первого элемента равен нулю. Индекс последнего элемента равен размеру массива минус один. Необходимо следить за тем, чтобы индексы находились внутри этого диапазона значений.

Массив можно инициализировать с помощью *списка инициализаторов*:

```c
int arr2[] = {1, 2, 3, 4};
```

Рамер массива при этом можно не указывать. Если указать размер массива больше, чем элементов в списке инициализаторов, то проинициализируются только соответствующие первые элементы.

**Пример 1. Гистограмма.**

На прошлом занятии вы писали самостоятельную работу. Заведем массив `scores` с вашими баллами:

```c
int scores[] = {5, 7, 6, 8, 9, 9, 6, 8, 6, 8, 7, 7, 7};
```

Заведем второй массив `hist`, с помощью которого посчитаем сколько раз было получено каждое значение баллов:

```c
int hist[11];
    
for (int i = 0; i < 11; ++i)
    hist[i] = 0;

for (int i = 0; i < 13; ++i)
    ++hist[scores[i]];
```

Наконец, выведем данные в консоль:

```c
for (int i = 0; i < 11; ++i) {
    printf("%2d: %2d  ", i, hist[i]);
    for (int j = 0; j < hist[i]; ++j)
        putchar('*');
    putchar('\n');
}
```

Вот результат:

```bash
 0:  0  
 1:  0  
 2:  0  
 3:  0  
 4:  0  
 5:  1  *
 6:  3  ***
 7:  4  ****
 8:  3  ***
 9:  2  **
10:  0
```

Функция `putchar` из библиотеки `stdio.h` позволяет выводить один символ в поток вывода (также существует функция `getchar`, которая получает из потока ввода один символ).

Звездочками (символ `*`) мы построили [*гистограмму*](https://ru.wikipedia.org/wiki/%D0%93%D0%B8%D1%81%D1%82%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B0).

## Строки

Строки в Си являются являются массивами элементов типа `char`:

```c
char s1[] = {'H', 'e', 'l', 'l', 'o', '\0'};
char s2[] = "Hello";
```

Объекты `s1` и `s2` представлены в памяти одинаково. Мы можем передать их в функцию `printf`:

```c
printf("%s\n%s\n", s1, s2);
```

Каждая строка в Си должна заканчиваться символом `\0`. Поэтому для строки `Hello` будет выделена память для хранения шести `char`. По той же причине мы добавили `\0` в массив `s1`. Иначе бы, например, функция `printf` не смогла бы верно найти конец строки.

Считывание строки из консоли:

```c
printf("What is your name?\n");
char s3[15];
scanf("%s", s3);
printf("Hello, %s\n", s3);
```

## Указатели

Указатель - это переменная, значение которой является адресом в памяти.
