# Конспект 16 сентября 2021

**Упражнение 1**. Написать программу для вывода первых `n` чисел Фибоначчи.

**Упражнение 2**. Написать программу для проверки простоты натурального числа. Число вводится с клавиатуры.

## Передача аргументов в функцию в Си

Передача агрумента в функию происходит *по значению*. Это значит, что в функцию передается *копия* переменной, которая имеет то же значение. Это значит, что передав аргумент типа `int` в функцию, мы не сможем изменить ее значение:

```c
#include <stdio.h>

void increment(int a) {
    ++a;
}

int main() {
    int value = 2;
    printf("%d ", value);
    increment(value);
    printf("%d\n", value);
    return 0;
}
```

Эта программа увеличила значение переменной `a`, которая существует только внутри функции `increment`. Значение переменной `value` в функции `main` осталось неизменным:

```bash
2 2
```

Мы научимся изменять значение переменной в функции, рассмотрев *указатели*.

## Указатели

Указатель - это переменная, значение которой является адресом в памяти.
